note/COA/COA Module 5.org
#+AUTHOR: Aryan Pandey
#+TITLE: COA Module 5
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../worg.css"/>
* Cache Consistency (aka Cache Coherency)
- For higher performance in a multiprocessor system, each processor will usually have its own cache.
- Cache coherence refers to the problem of keeping the data in these caches consistent.
** Causes of Cache Consistency problems
- Copy of line in cache \ne Copy of line in memory, there is loss of
  cache consistency.
  - Cause can be updated in memory line but not in cache
    or updated in cache but not in memory
- Due to some other bus master changing the data in memory.
* Interleaved and Associative Memory
** Associative Memory
- Any stored item can be accessed by using the content of item.
- Item stored in associative memory can be viewed having two field
  $$KEY,DATA$$
- Where *KEY* is the stored address and *DATA* is the information to be accessed.
- Associative searching is based on simultaneous matching of the key to be searched
  with the stored key associated with each line of data.
** Interleaved Memory
- 
* Types of RAM and ROM
** RAM
- RAM (Random Access Memory) is called so any memory location in this IC can be accessed randomly.
- Two types of RAM: SRAM (Static RAM) and DRAM (Dynamic RAM)
*** DRAM
- DRAM is made of capacitors
- Requires less number of components to make one bit cell, hence require less space on silicon wafer.
- Comparatively cheaper.
- Slower than SRAM, because capacitors require time for charging and discharging.
*** SRAM
- SRAM is made up of flip flops
- Each cell is made of flip flops
- Requires more components than DRAM
- Requires more space on silicon wafer and costlier.
- Fast compare to DRAM
** ROM
- ROM is a memory where user cannot write anything.
- The data to be stored in ROM is written by ROM manufracturer.
*** PROM
- PROM (Programmable Read Only Memory) aka OTP (One Time Programmable) coz it can be written only one time.
- When manufractured it is blank, once written on it, it cannot be re-written.
*** EPROM
- EPROM (Erasble Programmable Read Only Memory) now its replaced by EEPROM.
- The data written can be erased by keeping the EPROM IC in the UV box.
- EEPROM are erased by giving an extra supply voltage.
* Allocation Policies
- 3 Memory Allocation Policies:
  1. [[*Best Fit][Best Fit]]
  2. [[*Worst Fit][Worst Fit]]
  3. [[*Next Fit][Next Fit]]
** Best Fit
- Smallest avail fragment is searched and the required data is stored in that fragment.
** Worst Fit
- The largest avail block is used to store the data.
** Next Fit
- Immediate next empty block of a size equal or greater than data to be stored.
